---
kind: property
id: P:Autodesk.Revit.DB.Connector.MEPSystem
zh: 系统
source: html/20d05e83-1b7f-a7d5-3498-8c6b8627ff67.htm
---
# Autodesk.Revit.DB.Connector.MEPSystem Property

**中文**: 系统

The system of the connector belong to.

## Syntax (C#)
```csharp
public MEPSystem MEPSystem { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown on failure to get system.